#################### データ ####################
use strict;
use utf8;

package data;

# [習得できる最小Lv,'名前','概要']
our @craft_enhance = (
  [1,'アンチボディ',''],
  [1,'オウルビジョン',''],
  [1,'ガゼルフット',''],
  [1,'キャッツアイ',''],
  [1,'スケイルレギンス',''],
  [1,'ストロングブラッド',''],
  [1,'チックチック',''],
  [1,'ドラゴンテイル',''],
  [1,'ビートルスキン',''],
  [1,'マッスルベアー',''],
  [1,'メディテーション',''],
  [1,'ラビットイヤー',''],
  [5,'ケンタウロスレッグ',''],
  [5,'シェイプアニマル',''],
  [5,'ジャイアントアーム',''],
  [5,'スフィンクスノレッジ',''],
  [5,'デーモンフィンガー',''],
  [5,'ファイアブレス',''],
  [5,'リカバリィ',''],
  [5,'ワイドウィング',''],
);

our @craft_song = (
  [1,'アーリーバード',''],
  [1,'アンビエント',''],
  [1,'サモン・スモールアニマル',''],
  [1,'サモン・フィッシュ',''],
  [1,'ノイズ',''],
  [1,'バラード',''],
  [1,'モラル',''],
  [1,'レクイエム',''],
  [1,'レジスタンス',''],
  [5,'アトリビュート',''],
  [5,'キュアリオスティ',''],
  [5,'チャーミング',''],
  [5,'トランス',''],
  [5,'ノスタルジィ',''],
  [5,'ブレイク',''],
  [5,'ラブソング',''],
  [5,'ララバイ',''],
  [1,'終律：春の強風',''],
  [1,'終律：夏の生命',''],
  [1,'終律：秋の実り',''],
  [1,'終律：冬の寒風',''],
  [5,'終律：獣の咆吼',''],
  [5,'終律：草原の息吹',''],
  [5,'終律：華の宴',''],
  [5,'終律：蛇穴の苦鳴',''],
);

1;