#################### データ ####################
use strict;
use utf8;

package data;

### PC用マギ --------------------------------------------------
my @pcMagi = (
  {
    name   => '一騎当千',
    timing => 'メイン',
    target => '単体',
    cond   => '3～10',
    note   => '［モブ］のみ対象にできる。対象に［1D＋5］点のダメージを与える。ダメージの適用後、［マリョク］を1上げる。',
  },
  {
    name   => '英雄',
    timing => 'メイン',
    target => '単体',
    cond   => '9～12',
    note   => '対象に［お前の【社会】×2］点のダメージを与える。シナリオに3回使える。',
  },
  {
    name   => '回生の妙薬',
    timing => '開始／終了',
    target => '単体',
    cond   => '1～5',
    note   => '［ノックアウト］しているキャラクターのみ対象にできる。対象の［ノックアウト］を回復し、【耐久値】を最大値にする。セッションに1回使える。',
  },
  {
    name   => '全力全壊',
    timing => 'メイン',
    target => '単体',
    cond   => '3・6・9・12',
    note   => '対象に［2D］点のダメージを与える。ダメージの適用後、［マリョク］を2上げる。',
  },
  {
    name   => '狙撃',
    timing => 'メイン',
    target => '単体',
    cond   => '1・3・5・7・9・11',
    note   => '対象に［3＋マリョク］点のダメージを与える。',
  },
  {
    name   => 'ブレス',
    timing => 'メイン',
    target => '1～2体',
    cond   => '1～6',
    note   => '対象に5回のダメージを与える。ダメージの適用後、［マリョク］を1上げる。',
  },
  {
    name   => '怪力無双',
    timing => 'サブ',
    target => '自身',
    cond   => '1～6',
    note   => '［手番］が終わるまで《マギ》で与えるダメージを［お前の【身体】］点増やす。',
  },
  {
    name   => '死に損ない',
    timing => 'サブ',
    target => '自身',
    cond   => '2・5・7・10',
    note   => 'お前の【耐久値】を［マリョク＋5］点回復する。効果の適用後、［マリョク］を1上げる。',
  },
  {
    name   => '以心伝心',
    timing => 'ダメージ増加',
    target => '単体',
    cond   => '2・4・6・8・10・12',
    note   => '対象が与えるダメージを5回増やす。ラウンドに1回使える。',
  },
  {
    name   => '祝福の風',
    timing => 'ダメージ増加',
    target => '単体',
    cond   => '1・3・5・7・9・11',
    note   => '対象が与えるダメージを［お前の【異質】］点増やす。効果の適用後、［マリョク］を1下げる。ラウンドに1回使える。',
  },
  {
    name   => '心血の刃',
    timing => 'ダメージ増加',
    target => '単体',
    cond   => '2～7',
    note   => 'お前の【耐久値】を任意の点数減らす（最大でお前の【身体】点まで）。対象が与えるダメージを［減らした【耐久値】］点増やす。ラウンドに2回使える。',
  },
  {
    name   => '守護者',
    timing => '効果参照',
    target => '単体',
    cond   => '2・4・6・8・10・12',
    note   => 'ダメージ適用の直前に使用する。対象に与えられるダメージを、代わりにお前が受ける。その際、お前が受けるダメージを3回減らす。自身不可。',
  },
  {
    name   => '結界',
    timing => 'ダメージ減少',
    target => '単体',
    cond   => '1～6',
    note   => '対象に与えられるダメージを［お前の【異質】］点減らす。効果の適用後、［マリョク］を1下げる。ラウンドに1回使える。',
  },
  {
    name   => '破壊の指',
    timing => '開始',
    target => '効果参照',
    cond   => '7～12',
    note   => 'お前はエリアの［特性］を1つ選択する。選んだ［特性］を即座にエリアから取り除く。また、ラウンド終了までお前が《マギ》で与えるダメージを5点増やす。エリアに［特性］がない場合は使用できない。',
  },
  {
    name   => 'いたずら',
    timing => '効果参照',
    target => '効果参照',
    cond   => 'なし',
    note   => '［行動フェイズ］なら任意のタイミング、［ロケアクション］なら［ラウンドの終了］で使用する。［マリョク］をリセット（P150）する。セッションに3回使える。',
  },
  {
    name   => '浄化の音',
    timing => '効果参照',
    target => '効果参照',
    cond   => 'なし',
    note   => '［行動フェイズ］なら任意のタイミング、［ロケアクション］なら［【イニシアチブ】の確認］で使用する。［マリョク］の出目を［4］か［7］に変更する。セッションに3回まで使用可能。',
  },
  {
    name   => 'トリックスター',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => '6～12',
    note   => '［【イニシアチブ】の決定］のダイスロールの直後に使用する。対象とお前の【イニシアチブ】を入れ替える。',
  },
  {
    name   => '福招き',
    timing => '効果参照',
    target => '単体',
    cond   => '3～9',
    note   => '対象がダイスロールした直後に使用する。そのダイスロールをもう1度やり直す。シナリオに2回使える。',
  },
  {
    name   => 'まきもどし',
    timing => '効果参照',
    target => '自身',
    cond   => '１～７',
    note   => 'お前がダイスロールした直後に使用する。そのダイスロールをもう1度やり直す。セッションに3回使える。',
  },
  {
    name   => '駿足',
    timing => '常時',
    target => '自身',
    cond   => 'なし',
    note   => 'お前の【イニシアチブ】は［1D＋2］で決定する。',
  },
  {
    name   => '頑鉄',
    timing => '常時',
    target => '自身',
    cond   => 'なし',
    note   => 'お前の【耐久値】に＋3し、受けるダメージを常に2回減少する。お前の【イニシアチブ】は［1D－2］で決定する（最低1）。',
  },
);

our %pcMagiData;
our @pcMagiNames;
foreach my $data (@pcMagi){
  my $name = $data->{name};
  delete $data->{name};
  $pcMagiData{$name} = $data;
  push(@pcMagiNames, $name);
}

### クラン用マギ --------------------------------------------------
my @clanMagi = (
  {
    name   => 'スクランブル！',
    timing => '終了',
    target => '単体',
    cond   => '8～12',
    note   => '［マリョク］を7下げる。クラン全員がそれぞれ1Dをロールする（この効果には［ノックアウト］でも例外的に参加できる）。ロールしたダイスの［出目］を合計したダメージを対象に与える。このダメージには［ダメージ増加］の《マギ》を使用できない。セッションに1回使える。',
  },
  {
    name   => '諦め悪いんで',
    timing => '終了',
    target => 'クラン全員',
    cond   => '1～6',
    note   => 'クラン全員の【耐久値】を［1D＋マリョク］点回復する。セッションに1回使える。',
  },
  {
    name   => '悪名高き',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => 'なし',
    note   => '【社会】が指定された［判定］の直前に使う。代わりに【身体】か【異質】でロールできる。あるいは「判定に【社会】を使用できない」というアクシデント表の効果を無視する。セッションに3回使える。',
  },
  {
    name   => 'エース',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => 'なし',
    note   => '「【イニシアチブ】の確認」（P188）で使用する。対象は【イニシアチブ】に関係なく次に［手番］を得る。すでに［手番］を行ったキャラクターは対象にできない。セッションに1回使える。',
  },
  {
    name   => '同志たち',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => 'なし',
    note   => '対象が［ノックアウト］になった直後に使用する。対象の［ノックアウト］を回復し、【耐久値】を１５点にする。セッションに2回使える',
  },
  {
    name   => '特別部署',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => 'なし',
    note   => '【身体】が指定された［判定］の直前に使う。代わりに【異質】か【社会】でロールできる。あるいは「判定に【身体】を使用できない」というアクシデント表の効果を無視する。セッションに3回使える。',
  },
  {
    name   => '人気グループ',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => '3～10',
    note   => '［住民］［店員］［警備員］などの［特性］があるエリアのみ使える。ダイスロールした直後に使用する。ロールしたダイス1個の出目を2下げる。［ロケアクション］中は効果を発揮しない。セッションに3回使える。',
  },
  {
    name   => 'プランB',
    timing => '効果参照',
    target => '単体（クラン）',
    cond   => '1・3・5・7・9・11',
    note   => '対象がダイスロールした直後に使う。そのダイスロールをもう1度やり直す。セッションに3回使える。',
  },
  {
    name   => 'アレ出しとこうか',
    timing => '開始',
    target => 'クラン全員',
    cond   => 'なし',
    note   => '［ロケアクション］が終わるまで、クラン全員が攻撃で与えるダメージを3回増やす。セッションに1回使える。',
  },
  {
    name   => 'クラン体操第一',
    timing => '開始',
    target => 'クラン全員',
    cond   => 'なし',
    note   => '［ロケアクション］が終わるまで、クラン全員が受けるダメージを3回減らす。セッションに1回使える。',
  },
  {
    name   => '戦闘集団',
    timing => '常時',
    target => 'クラン全員',
    cond   => 'なし',
    note   => '対象が攻撃で与えるダメージを常に2回増やす。',
  },
  {
    name   => 'スポーツチーム',
    timing => '常時',
    target => 'クラン全員',
    cond   => 'なし',
    note   => '対象の【イニシアチブ】は［1D＋1］で決定する。ほかの《マギ》で【イニシアチブ】の決め方が変わっているPCは、この《マギ》の効果を受けない。',
  },
);

our %clanMagiData;
our @clanMagiNames;
foreach my $data (@clanMagi){
  my $name = $data->{name};
  delete $data->{name};
  $clanMagiData{$name} = $data;
  push(@clanMagiNames, $name);
}



1;