#################### データ ####################
use strict;
use utf8;

package data;

### スタイルデータ --------------------------------------------------
my @styles = (
  { class => 'ロード', name => 'セイバー',       stt => [2,2,1,0,1,0, 14,10,10, 6] },
  { class => 'ロード', name => 'パラディン',     stt => [1,2,0,0,2,1, 13,11,10, 6] },
  { class => 'ロード', name => 'ルーラー',       stt => [0,1,0,2,2,1, 11,13, 7, 9] },
  { class => 'ロード', name => 'アーチャー',     stt => [1,1,2,0,2,0, 14,10, 9, 7] },
  { class => 'ロード', name => 'キャヴァリアー', stt => [2,2,0,0,1,1, 13,11,10, 6] },
  { class => 'ロード', name => 'メサイア',       stt => [0,1,0,1,2,2, 10,14, 7, 9] },
  { class => 'メイジ', name => 'エレメンタラー', stt => [0,1,1,0,2,2, 11,13, 7, 9] },
  { class => 'メイジ', name => 'ヒーラー',       stt => [0,1,0,2,1,2, 10,14, 6,10] },
  { class => 'メイジ', name => 'プロフェット',   stt => [0,0,2,2,1,1, 10,14, 6,10] },
  { class => 'メイジ', name => 'アルケミスト',   stt => [0,0,2,2,1,1, 11,13, 8, 8] },
  { class => 'メイジ', name => 'サイキック',     stt => [0,1,2,1,0,2, 11,13, 7, 9] },
  { class => 'メイジ', name => 'サモナー',       stt => [0,0,1,1,2,2,  9,15, 5,11] },
  { class => 'アーティスト',name => 'アンデッド',         stt => [2,1,1,0,2,0, 14,10,11, 5] },
  { class => 'アーティスト',name => 'シャドウ',           stt => [1,2,1,0,2,0, 15, 9, 9, 7] },
  { class => 'アーティスト',name => 'シューター',         stt => [0,2,2,0,1,1, 13,11, 9, 7] },
  { class => 'アーティスト',name => 'ライカンスロープ',   stt => [2,1,2,1,0,0, 12,12, 9, 7] },
  { class => 'アーティスト',name => 'アームズ',           stt => [2,2,1,0,1,0, 13,11,10, 6] },
  { class => 'アーティスト',name => 'エーテル',           stt => [2,2,1,0,0,1, 12,12, 8, 8] },
  { class => 'アーティスト',name => 'レイヤー:ヒロイック',stt => [1,2,0,0,2,1, 13,11,10, 6] },
  { class => 'アーティスト',name => 'レイヤー:ドラゴン'  ,stt => [2,1,2,0,1,0, 14,10,11, 5] },
);

### ワークスデータ --------------------------------------------------
my @works = (
  { name => '暗殺者',  stt => [10,12,12, 8,11, 7,14,10] },
  { name => '学者',    stt => [ 7, 8,11,13,12, 9,10,14] },
  { name => '狩人',    stt => [ 9,12,12, 8,10, 9,12,12] },
  { name => '貴族A',   stt => [10, 9, 9,11, 9,12,12,12] },
  { name => '貴族B',   stt => [12,12, 9,10, 9, 8,13,11] },
  { name => '貴族C',   stt => [ 9, 9,12, 9,11,10,12,12] },
  { name => '貴族D',   stt => [ 9, 8,10,12,12, 9,11,13] },
  { name => '騎兵',    stt => [11,11,10, 9,10, 9,13,11] },
  { name => '吟遊詩人',stt => [ 8, 7, 9,11,12,13,11,13] },
  { name => '軍師',    stt => [ 8, 8,11,12,10,11,10,14] },
  { name => '剣闘士',  stt => [12,12, 8, 7,10,11,13,11] },
  { name => '交渉人',  stt => [ 8, 7,10,12,11,12,11,13] },
  { name => '護衛',    stt => [12, 9,11, 9,10, 9,13,11] },
  { name => '指揮官',  stt => [11,11, 8,10, 9,11,13,11] },
  { name => '従者',    stt => [10,12, 9, 7,12,10,13,11] },
  { name => '将軍',    stt => [12,11, 9, 9, 9,10,12,12] },
  { name => '商人',    stt => [ 9, 8,11,11,10,11,12,12] },
  { name => '治癒師',  stt => [ 8, 8, 9,13,10,12,10,14] },
  { name => '盗賊',    stt => [11,12,12,10, 7, 8,13,11] },
  { name => '野伏',    stt => [ 9,10,13, 9,11, 8,13,11] },
  { name => '兵士',    stt => [11, 9,11, 8,12, 9,14,10] },
  { name => '冒険者',  stt => [10,12,12, 9, 9, 8,12,12] },
  { name => '無法者',  stt => [12,12,11, 8,10, 7,14,10] },
  { name => '弓兵',    stt => [10,10,12,11, 9, 8,13,11] },
  { name => '傭兵',    stt => [12,12,10, 9, 9, 8,14,10] },
  { name => '騎士A',   stt => [11,11, 9, 9,10,10,13,11] },
  { name => '騎士B',   stt => [10,10,12, 9,10, 9,12,12] },
  { name => '騎士C',   stt => [ 9, 8,10,11,12,10,11,13] },
  { name => '騎士D',   stt => [ 9, 9, 9,11,10,12,11,13] },
  { name => 'アカデミー学生A',stt => [ 8, 8,11,11,10,12,11,13] },
  { name => 'アカデミー学生B',stt => [ 9, 8, 9,12,11,11,10,14] },
  { name => 'アカデミー学生C',stt => [ 8, 8,12,10,12,10,11,13] },
  { name => 'アカデミー学生D',stt => [10,10,10,10,10,10,12,12] },
  { name => '契約魔法師A',stt => [ 8, 8,10,12,10,12,10,14] },
  { name => '契約魔法師B',stt => [ 9, 9,12,11, 9,10,11,13] },
  { name => '契約魔法師C',stt => [10,10, 9,10,12, 9,12,12] },
  { name => '契約魔法師D',stt => [ 8, 8,11,11,11,11,11,13] },
);

our @classNames;
our @styleNames;
our @worksNames;
our %styleData;
our %worksData;
foreach my $data (@styles){
  push(@classNames, $data->{class}) if !grep { $_ eq $data->{class} } @classNames;
  push(@styleNames, $data->{name});
  $styleData{$data->{name}} = $data;
  $styleData{$data->{name}}{stt} = {
    Str => $data->{stt}[0],
    Ref => $data->{stt}[1],
    Per => $data->{stt}[2],
    Int => $data->{stt}[3],
    Mnd => $data->{stt}[4],
    Emp => $data->{stt}[5],
    Hp => $data->{stt}[6],
    Mp => $data->{stt}[7],
    HpGrow => $data->{stt}[8],
    MpGrow => $data->{stt}[9],
  };
}
foreach my $data (@works){
  push(@worksNames, $data->{name});
  $worksData{$data->{name}} = $data;
  $worksData{$data->{name}}{stt} = {
    Str => $data->{stt}[0],
    Ref => $data->{stt}[1],
    Per => $data->{stt}[2],
    Int => $data->{stt}[3],
    Mnd => $data->{stt}[4],
    Emp => $data->{stt}[5],
    Hp => $data->{stt}[6],
    Mp => $data->{stt}[7],
  };
}


1;